Revit 2026 API

# RevisionReorderRevisionSequence Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ReorderRevisionSequence(
	Document document,
	IList<ElementId> newSequence
)
```
```vb
Public Shared Sub ReorderRevisionSequence (
	document As Document,
	newSequence As IList(Of ElementId)
)
```
```cpp
public:
static void ReorderRevisionSequence(
	Document^ document,
	IList<ElementId^>^ newSequence
)
```
```fsharp
static member ReorderRevisionSequence :
        document : Document *
        newSequence : IList<ElementId> -> unit
```

#### Parameters

document Document

newSequence IListElementId

#### Reference

Revision Class

Autodesk.Revit.DB Namespace